Tekla Open API Reference for Tekla Structures 2025
CurvedSectionMark Properties
The CurvedSectionMark type exposes the following members.
Properties
Name | Description
Attributes
 The attributes for the section mark.
 (Inherited from SectionMarkBase.)
LeftPoint
 The starting point of the left symbol of the section mark.
 (Inherited from SectionMarkBase.)
MiddlePoint
 The middle arc point of a curved section mark.
QueryReturnValue
 Status information about the latest database operation (select, insert, modify, delete).
 (Inherited from DatabaseObject.)
RightPoint
 The starting point of the right symbol of the section mark.
 (Inherited from SectionMarkBase.)
Top
See Also
Reference
CurvedSectionMark Class
Tekla.Structures.Drawing Namespace